#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.single_zone.data.archive_file.revalidation_function[0]: Reading...
module.single_zone.data.archive_file.image_optimisation_function[0]: Reading...
module.single_zone.data.archive_file.warmer_function[0]: Reading...
module.single_zone.data.archive_file.revalidation_function[0]: Read complete after 0s [id=825e237f6ea94770aba498bc626a8cc05a88996a]
module.single_zone.data.archive_file.warmer_function[0]: Read complete after 0s [id=e5094e337d97bf663bebb451657f5785a9dda36d]
module.single_zone.module.public_resources[0].data.aws_cloudfront_origin_request_policy.all_viewer_except_host_header: Reading...
module.single_zone.module.public_resources[0].aws_cloudfront_cache_policy.cache_policy[0]: Refreshing state... [id=06efa7e0-f0db-4669-832e-5b76036eb9b1]
module.single_zone.module.public_resources[0].data.aws_region.current: Reading...
module.single_zone.module.public_resources[0].data.aws_cloudfront_cache_policy.caching_optimized: Reading...
module.single_zone.module.public_resources[0].aws_cloudfront_origin_access_control.website_origin_access_control: Refreshing state... [id=E3RNQ0V4MAIQ68]
module.http-redirect.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:615299762949:certificate/c69ccd6e-eece-4944-b5d5-e191ea5376aa]
module.single_zone.module.public_resources[0].aws_cloudfront_function.x_forwarded_host: Refreshing state... [id=vltech-website-x-forwarded-host-function]
module.single_zone.module.public_resources[0].data.aws_region.current: Read complete after 0s [id=us-east-1]
module.single_zone.module.public_resources[0].data.aws_cloudfront_origin_request_policy.all_viewer_except_host_header: Read complete after 0s [id=b689b0a8-53d0-40ab-baf2-68738e2966ac]
module.single_zone.module.public_resources[0].data.aws_cloudfront_cache_policy.caching_optimized: Read complete after 0s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
module.single_zone.module.server_function.data.aws_caller_identity.current: Reading...
module.single_zone.module.server_function.data.aws_region.current: Reading...
module.single_zone.module.open_next_aliases[0].aws_ssm_parameter.origin_aliases: Refreshing state... [id=vltech-website-website-origin-aliases]
module.single_zone.module.revalidation_function.data.aws_caller_identity.current: Reading...
module.single_zone.aws_sqs_queue.revalidation_queue: Refreshing state... [id=https://sqs.eu-central-1.amazonaws.com/615299762949/vltech-website-isr-queue.fifo]
module.single_zone.module.server_function.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.single_zone.data.aws_region.current: Reading...
module.single_zone.module.public_resources[0].data.aws_route53_zone.hosted_zone["victorlevasseur.tech-false"]: Reading...
module.http-redirect.aws_cloudfront_function.redirect: Refreshing state... [id=http-redirect]
module.single_zone.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.single_zone.aws_s3_bucket.bucket[0]: Refreshing state... [id=vltech-website-website-bucket]
module.single_zone.module.server_function.aws_iam_role.lambda_iam: Refreshing state... [id=vltech-website-server-function-role]
module.single_zone.data.archive_file.image_optimisation_function[0]: Read complete after 1s [id=a3dbed30ee6a30f677b3967995baf974d801ccdc]
module.single_zone.module.image_optimisation_function[0].aws_iam_role.lambda_iam: Refreshing state... [id=vltech-website-image-optimization-function-role]
module.single_zone.module.revalidation_function.data.aws_caller_identity.current: Read complete after 0s [id=615299762949]
module.single_zone.module.revalidation_function.aws_iam_role.lambda_iam: Refreshing state... [id=vltech-website-revalidation-function-role]
module.single_zone.module.server_function.data.aws_caller_identity.current: Read complete after 0s [id=615299762949]
module.http-redirect.data.aws_route53_zone.zone: Reading...
module.single_zone.aws_dynamodb_table.isr_table[0]: Refreshing state... [id=vltech-website-isr-tag-mapping]
module.single_zone.module.revalidation_function.data.aws_region.current: Reading...
module.single_zone.module.revalidation_function.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.single_zone.module.image_optimisation_function[0].data.aws_region.current: Reading...
module.single_zone.module.image_optimisation_function[0].data.aws_region.current: Read complete after 0s [id=eu-central-1]
data.aws_caller_identity.current: Reading...
module.single_zone.module.image_optimisation_function[0].data.aws_caller_identity.current: Reading...
module.single_zone.module.public_resources[0].data.aws_route53_zone.hosted_zone["victorlevasseur.tech-false"]: Read complete after 1s [id=Z01305181G23H04WP32YA]
module.single_zone.module.revalidation_function.aws_cloudwatch_log_group.lambda_log_group[0]: Refreshing state... [id=/aws/lambda/vltech-website-revalidation-function]
module.single_zone.module.server_function.aws_cloudwatch_log_group.lambda_log_group[0]: Refreshing state... [id=/aws/lambda/vltech-website-server-function]
data.aws_caller_identity.current: Read complete after 0s [id=615299762949]
module.single_zone.module.image_optimisation_function[0].aws_cloudwatch_log_group.lambda_log_group[0]: Refreshing state... [id=/aws/lambda/vltech-website-image-optimization-function]
module.single_zone.module.image_optimisation_function[0].data.aws_caller_identity.current: Read complete after 0s [id=615299762949]
module.single_zone.module.revalidation_function.aws_lambda_function.lambda_function: Refreshing state... [id=vltech-website-revalidation-function]
module.http-redirect.data.aws_route53_zone.zone: Read complete after 0s [id=Z01305181G23H04WP32YA]
module.http-redirect.aws_route53_record.cert_validation["victorlevasseur.tech"]: Refreshing state... [id=Z01305181G23H04WP32YA__abc41aced5334d86bdd43adac171c372.victorlevasseur.tech._CNAME]
module.http-redirect.aws_acm_certificate_validation.cert: Refreshing state... [id=2025-02-13 14:11:52.205 +0000 UTC]
module.single_zone.module.open_next_aliases[0].data.aws_ssm_parameter.origin_aliases: Reading...
module.http-redirect.aws_cloudfront_distribution.distribution: Refreshing state... [id=E3AXV12PY17NPX]
module.single_zone.module.open_next_aliases[0].data.aws_ssm_parameter.origin_aliases: Read complete after 0s [id=vltech-website-website-origin-aliases]
module.http-redirect.aws_route53_record.main["victorlevasseur.tech"]: Refreshing state... [id=Z01305181G23H04WP32YA_victorlevasseur.tech_A]
module.single_zone.module.revalidation_function.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::615299762949:policy/vltech-website-revalidation-function-lambda-policy]
module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/layout-d-3LMEC_2wlROao-vtI6Q/sitemap.xml"]: Refreshing state... [id=5a8f826a-12d7-3aca-72d2-d905d309e11d]
module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/favicon.ico/layout"]: Refreshing state... [id=53e885f5-6d19-1265-05d4-4f5a6db5d4a2]
module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/cgv"]: Refreshing state... [id=ae2f1d79-3bb0-bda1-1c89-f7ea80326212]
module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/layout-d-3LMEC_2wlROao-vtI6Q/apple-icon.png"]: Refreshing state... [id=b9b5eb65-a0ca-5602-812f-bfc50b04bfc1]
module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/icon.svg/route"]: Refreshing state... [id=b500aeb8-d7c5-7df6-31f4-1d6c47865f04]
module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/sitemap.xml/layout"]: Refreshing state... [id=4acb64e1-429f-bc19-4ae7-9a31429bdd75]
module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/icon.svg"]: Refreshing state... [id=afe6a38e-d7d2-fc70-6f59-c0480b88519d]
module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/sitemap.xml/route"]: Refreshing state... [id=85f0371d-cede-f559-23d6-fafd6f0271e3]
module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/apple-icon.png/route"]: Refreshing state... [id=e2bf2fe4-d2cd-4284-e4cc-edd6a199f3e5]
module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/sitemap.xml"]: Refreshing state... [id=25d1385f-57bb-0439-2c9e-99bd58f8d66f]
module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/favicon.ico/route"]: Refreshing state... [id=555a3ba0-f92b-fb70-3df1-1ba12c9efb50]
module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/apple-icon.png/layout"]: Refreshing state... [id=6d1dd48b-fbfd-fa42-8764-7c429ace74a1]
module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/cgv/layout"]: Refreshing state... [id=582d6999-e02e-d8ef-a6d6-388a30d0b5e6]
module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/layout-d-3LMEC_2wlROao-vtI6Q/icon.svg"]: Refreshing state... [id=5f750aad-a23c-2b3d-0587-786870115a92]
module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/icon.svg/layout"]: Refreshing state... [id=da4dd115-08db-a309-5a12-a1b86bc47b5e]
module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/_not-found"]: Refreshing state... [id=d458912e-3c75-e100-aefe-363503d03741]
module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/cgv/page"]: Refreshing state... [id=53779383-ff47-3831-bdaa-3262f8eebe7d]
module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/apple-icon.png"]: Refreshing state... [id=e95cd2a6-bf2c-60d7-bfd3-08e448b9ac9e]
module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/_not-found/page"]: Refreshing state... [id=693c511e-7d48-12da-2420-033e4ee137ff]
module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/"]: Refreshing state... [id=cd675b83-3f0e-2809-586d-4a76f1c574a2]
module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/_not-found/layout"]: Refreshing state... [id=222a84e0-2a59-9b97-b0d3-54fe02e7e9eb]
module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/page"]: Refreshing state... [id=1475dba4-d8b2-e049-29bd-dc57c5fb018e]
module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/favicon.ico"]: Refreshing state... [id=df57e89b-0052-4dc4-fa41-7b4d53df4757]
module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/layout-d-3LMEC_2wlROao-vtI6Q/index"]: Refreshing state... [id=26e00b62-2a52-92e3-b983-1816c9e8a086]
module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/layout-d-3LMEC_2wlROao-vtI6Q/favicon.ico"]: Refreshing state... [id=817cbbf1-9d53-4d82-785d-5d2ce85d7184]
module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/layout-d-3LMEC_2wlROao-vtI6Q/cgv"]: Refreshing state... [id=b7bb7d9c-b66a-8023-3979-fe02f12a10b9]
module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/layout-d-3LMEC_2wlROao-vtI6Q/_not-found"]: Refreshing state... [id=418f5693-b61c-3416-c159-ccc28713b5e6]
module.single_zone.module.revalidation_function.aws_iam_role_policy_attachment.policy_attachment: Refreshing state... [id=vltech-website-revalidation-function-role-20241218205629363600000001]
module.single_zone.module.revalidation_function.aws_lambda_alias.lambda_alias["stable"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-revalidation-function:stable]
module.single_zone.aws_lambda_event_source_mapping.revalidation_queue_source: Refreshing state... [id=23604771-f7d2-432b-ba67-c4d45c3c7817]
module.single_zone.module.revalidation_function.terraform_data.update_alias[0]: Refreshing state... [id=22986d2d-9503-b7f8-def7-84ab924dba32]
module.single_zone.module.revalidation_function.aws_lambda_function_url.function_url["stable"]: Refreshing state... [id=vltech-website-revalidation-function/stable]
module.single_zone.module.server_function.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::615299762949:policy/vltech-website-server-function-lambda-policy]
module.single_zone.module.image_optimisation_function[0].aws_lambda_function.lambda_function: Refreshing state... [id=vltech-website-image-optimization-function]
module.single_zone.data.archive_file.server_function[0]: Reading...
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/a8eac78432f0a60b-s.woff2"]: Refreshing state... [id=9e031051-5705-f03c-c644-4ca8b9261bf5]
module.single_zone.module.s3_assets.terraform_data.file_sync["d-3LMEC_2wlROao-vtI6Q/apple-icon.png.cache"]: Refreshing state... [id=9eb88266-5130-b725-0144-1a8f43e5e2b9]
module.single_zone.module.image_optimisation_function[0].aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::615299762949:policy/vltech-website-image-optimization-function-lambda-policy]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/d0697bdd3fb49a78-s.woff2"]: Refreshing state... [id=9076105b-745e-e65e-ec39-f64e126aac2e]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/382b6f43e60580be-s.woff2"]: Refreshing state... [id=02cd3ae0-21e8-4118-e990-2aebe2360167]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/b32bc20a1e277f31-s.woff2"]: Refreshing state... [id=321d4549-ae06-3830-42eb-cfce7a6e73cf]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/main-app-d4c84837250c81b8.js"]: Refreshing state... [id=fbe0b5a6-0ff9-f248-fb8d-1f39b44a8105]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/357398c3a461852b-s.woff2"]: Refreshing state... [id=e42276e7-9c0c-c131-fdcf-2a5abf5f7666]
module.single_zone.module.s3_assets.terraform_data.file_sync["d-3LMEC_2wlROao-vtI6Q/cgv.cache"]: Refreshing state... [id=dff691fa-92c1-d285-39cd-dcdd69b73293]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/webpack-984cbc839a680ab5.js"]: Refreshing state... [id=0326f31c-3e63-6c97-3dcd-1937ad8c78fc]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/d-3LMEC_2wlROao-vtI6Q/_ssgManifest.js"]: Refreshing state... [id=46814a4e-586f-4048-f404-98042c2a7f66]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/9bbb7f84f3601865-s.woff2"]: Refreshing state... [id=325d0d9e-b078-18a5-55c7-a53c90d5c6d5]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/polyfills-42372ed130431b0a.js"]: Refreshing state... [id=83abb4c2-13d6-9782-a9c9-1f886e23d3a1]
module.single_zone.module.s3_assets.terraform_data.file_sync["d-3LMEC_2wlROao-vtI6Q/index.cache"]: Refreshing state... [id=2d3ddee9-913c-e76b-9f87-76a5c4a469bd]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/d-3LMEC_2wlROao-vtI6Q/_buildManifest.js"]: Refreshing state... [id=fd627028-348c-2400-caa7-8d41b1547ad6]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/978-2e23e15eb2d9825e.js"]: Refreshing state... [id=08c3e02a-0a97-2c74-2cfe-bc127cd57f15]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/173-fc558b54b5be890b.js"]: Refreshing state... [id=bae8c547-8fd3-1d15-a8aa-1e2e1fb9c4d5]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/517-47d8fb00497672e4.js"]: Refreshing state... [id=a6a618da-575c-c65c-ffec-d19aeebed804]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/pages/_app-d23763e3e6c904ff.js"]: Refreshing state... [id=a0a95740-9bd1-bbc5-3088-e6e5d18fff57]
module.single_zone.module.s3_assets.terraform_data.file_sync["BUILD_ID"]: Refreshing state... [id=2aab1fc2-4689-8746-f3a1-8708229a17d9]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/page-b5896372898a26b5.js"]: Refreshing state... [id=bc9d1baf-5248-765c-dec3-717d504374f3]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/9f05b6a2725a7318-s.woff2"]: Refreshing state... [id=ac4a618e-66ed-1415-d02d-9d88a4c281ad]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/pages/_error-9b7125ad1a1e68fa.js"]: Refreshing state... [id=75ef6842-85f2-603c-3c4b-cd67c9b9561f]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/bc270b3a577192a7-s.woff2"]: Refreshing state... [id=16b8f0c3-94b5-168f-1fc9-f51adc0e8a3c]
module.single_zone.module.s3_assets.terraform_data.file_sync["d-3LMEC_2wlROao-vtI6Q/_not-found.cache"]: Refreshing state... [id=768e399e-6fad-62a6-9d69-fe46d061a9d8]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/4d1af68a2715a16a-s.p.woff2"]: Refreshing state... [id=e72e9c33-e3f8-1fde-1eb0-6a73205452e8]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/layout-dbf93d4b3b66ee0d.js"]: Refreshing state... [id=f70e794e-46fc-f612-0b45-1bcaab0b96a8]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/main-8afb5c88d2340613.js"]: Refreshing state... [id=466372c9-168c-2f72-f31f-51cac8590e83]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/42aa6e6ea3b85651-s.woff2"]: Refreshing state... [id=59d3c0ee-ae3d-7390-a731-81f5168d647a]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/css/01b81fc6c4002686.css"]: Refreshing state... [id=de26967e-7b67-5a54-f6e4-3b45a00acb1c]
module.single_zone.module.s3_assets.terraform_data.file_sync["favicon.ico"]: Refreshing state... [id=d538d61d-dce0-cc44-df24-44711711892d]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/122c360d7fe6d395-s.p.woff2"]: Refreshing state... [id=674ad872-ee9b-89bd-9252-351607ab6caf]
module.single_zone.module.s3_assets.terraform_data.file_sync["assets/vltech_logo.png"]: Refreshing state... [id=5580fd80-287a-0715-aa66-6da5c311462b]
module.single_zone.module.s3_assets.terraform_data.file_sync["d-3LMEC_2wlROao-vtI6Q/sitemap.xml.cache"]: Refreshing state... [id=5bd8ae58-3a52-57a2-9103-6b957576f4dd]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/7bafef50a4560c1d-s.woff2"]: Refreshing state... [id=271e32ae-abf0-ca24-a29d-49260817d15a]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/css/b8022cc0231a4bfd.css"]: Refreshing state... [id=715e82b9-4752-4d03-4e14-bba9b5b369bd]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/cgv/page-2f9874ecc3099b18.js"]: Refreshing state... [id=34f45cf6-bb8a-9b44-d95d-0c917d12f956]
module.single_zone.module.s3_assets.terraform_data.file_sync["d-3LMEC_2wlROao-vtI6Q/icon.svg.cache"]: Refreshing state... [id=4037ad76-8edb-95b7-9aad-ac9b313fb1c2]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/c740c1d45290834f-s.woff2"]: Refreshing state... [id=6c695a5c-d238-b55a-e737-abff99fcd32c]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/framework-a6eb4bce5bd8ed9b.js"]: Refreshing state... [id=2e38b1f6-e9cc-8645-2869-3d55b50564e3]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/_not-found/page-b2447a23980919fd.js"]: Refreshing state... [id=86b17e9c-0ff0-125e-e384-6bbaf9c2d977]
module.single_zone.module.s3_assets.terraform_data.file_sync["documents/cgv.pdf"]: Refreshing state... [id=c76dce72-1386-d74a-4047-b8fa9d7b4f05]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/4bd1b696-c579319bb9b05615.js"]: Refreshing state... [id=ac913217-a6e6-32d9-66ab-7bca99b23029]
module.single_zone.module.s3_assets.terraform_data.file_sync["d-3LMEC_2wlROao-vtI6Q/favicon.ico.cache"]: Refreshing state... [id=e8a069fe-199a-d1db-efaa-57794a80a131]
module.single_zone.module.s3_assets.terraform_data.file_sync["d-3LMEC_2wlROao-vtI6Q/500.cache"]: Refreshing state... [id=f03a02f6-4368-6b0b-6cbc-9057739dbc7c]
module.single_zone.module.server_function.aws_iam_role_policy_attachment.policy_attachment: Refreshing state... [id=vltech-website-server-function-role-20241218205750451600000001]
module.single_zone.module.image_optimisation_function[0].aws_iam_role_policy_attachment.policy_attachment: Refreshing state... [id=vltech-website-image-optimization-function-role-20241218205750570200000002]
module.single_zone.module.image_optimisation_function[0].aws_lambda_alias.lambda_alias["opennext"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:opennext]
module.single_zone.module.image_optimisation_function[0].aws_lambda_permission.function_url_permission[0]: Refreshing state... [id=terraform-20241218205755531800000003]
module.single_zone.module.image_optimisation_function[0].aws_lambda_alias.lambda_alias["nextjs"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:nextjs]
module.single_zone.module.image_optimisation_function[0].terraform_data.update_alias[0]: Refreshing state... [id=bba5cb2b-44e8-23f5-5f61-ee635339623a]
module.single_zone.module.image_optimisation_function[0].aws_lambda_function_url.function_url["opennext"]: Refreshing state... [id=vltech-website-image-optimization-function/opennext]
module.single_zone.module.image_optimisation_function[0].aws_lambda_function_url.function_url["nextjs"]: Refreshing state... [id=vltech-website-image-optimization-function/nextjs]
module.single_zone.data.archive_file.server_function[0]: Read complete after 1s [id=431712e56f143a675874b164a93f332e2474aa83]
module.single_zone.module.server_function.aws_lambda_function.lambda_function: Refreshing state... [id=vltech-website-server-function]
module.single_zone.module.server_function.aws_lambda_alias.lambda_alias["opennext"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:opennext]
module.single_zone.module.server_function.aws_lambda_alias.lambda_alias["nextjs"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:nextjs]
module.single_zone.module.server_function.aws_lambda_permission.function_url_permission[0]: Refreshing state... [id=terraform-20241218205803707400000004]
module.single_zone.module.server_function.terraform_data.update_alias[0]: Refreshing state... [id=469b777b-1e93-b36a-4fff-77386d1f2dff]
module.single_zone.module.server_function.aws_lambda_function_url.function_url["opennext"]: Refreshing state... [id=vltech-website-server-function/opennext]
module.single_zone.module.server_function.aws_lambda_function_url.function_url["nextjs"]: Refreshing state... [id=vltech-website-server-function/nextjs]
module.single_zone.module.public_resources[0].aws_cloudfront_distribution.production_distribution[0]: Refreshing state... [id=EU3DKQFOTEI79]
module.single_zone.module.public_resources[0].aws_route53_record.route53_a_record["victorlevasseur.tech-false"]: Refreshing state... [id=Z01305181G23H04WP32YA_www.victorlevasseur.tech_A]
module.single_zone.module.public_resources[0].aws_route53_record.route53_aaaa_record["victorlevasseur.tech-false"]: Refreshing state... [id=Z01305181G23H04WP32YA_www.victorlevasseur.tech_AAAA]
module.single_zone.aws_s3_bucket_policy.bucket_policy[0]: Refreshing state... [id=vltech-website-website-bucket]
module.single_zone.terraform_data.update_aliases[0]: Refreshing state... [id=49c58d79-1f33-2d00-f3ea-d2bf33d20bfb]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.single_zone.terraform_data.isr_table_item["acmwwFul_eRwbtcUiFOMV/_N_T_/"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "58eb89b6df70e40500b71ca39179f3bb",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["acmwwFul_eRwbtcUiFOMV/_N_T_/_not-found"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "614e2290a947cf4b47e866f586623076",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["acmwwFul_eRwbtcUiFOMV/_N_T_/_not-found/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "5b524989bea2729c46398eda9275619a",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["acmwwFul_eRwbtcUiFOMV/_N_T_/_not-found/page"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "da6f406c67f2b88505f119894e173d21",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["acmwwFul_eRwbtcUiFOMV/_N_T_/apple-icon.png"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "41a218b1797bfdebfbe1fc667aa03f33",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["acmwwFul_eRwbtcUiFOMV/_N_T_/apple-icon.png/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "f570d1084c7cf73118636e5e321b5b18",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["acmwwFul_eRwbtcUiFOMV/_N_T_/apple-icon.png/route"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "552b76589ca85da92ff468fb9a1a8fbf",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["acmwwFul_eRwbtcUiFOMV/_N_T_/cgv"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "e409d860662e2b17b86f7e6fb6d32d5f",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["acmwwFul_eRwbtcUiFOMV/_N_T_/cgv/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "a4e2c67e270a3115d70383a59d73cc76",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["acmwwFul_eRwbtcUiFOMV/_N_T_/cgv/page"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "0d2c897738f8426f1c546467e440552e",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["acmwwFul_eRwbtcUiFOMV/_N_T_/favicon.ico"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "be574bfd6ac08b04ddba9ccd4f5698b5",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["acmwwFul_eRwbtcUiFOMV/_N_T_/favicon.ico/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "0df015029b5f654d264ccae903323c30",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["acmwwFul_eRwbtcUiFOMV/_N_T_/favicon.ico/route"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "99c5b22615692c9e42c1794101b81bc7",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["acmwwFul_eRwbtcUiFOMV/_N_T_/icon.svg"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "525daeb26d13cddf4fc286df47f5af09",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["acmwwFul_eRwbtcUiFOMV/_N_T_/icon.svg/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "072e16d3b2f744588d9b7c499f399fec",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["acmwwFul_eRwbtcUiFOMV/_N_T_/icon.svg/route"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "9d3536ffaae8d26054af79bd7a19a06d",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["acmwwFul_eRwbtcUiFOMV/_N_T_/layout-acmwwFul_eRwbtcUiFOMV/_not-found"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "3cb6545af30e24afed540d9841c0341b",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["acmwwFul_eRwbtcUiFOMV/_N_T_/layout-acmwwFul_eRwbtcUiFOMV/apple-icon.png"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "34dd01694955a82b53f64a78c128012f",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["acmwwFul_eRwbtcUiFOMV/_N_T_/layout-acmwwFul_eRwbtcUiFOMV/cgv"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "8e7a99301e7a5ad06017686e35339b8b",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["acmwwFul_eRwbtcUiFOMV/_N_T_/layout-acmwwFul_eRwbtcUiFOMV/favicon.ico"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "47d17a2d5a106b82256c50043c7815b5",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["acmwwFul_eRwbtcUiFOMV/_N_T_/layout-acmwwFul_eRwbtcUiFOMV/icon.svg"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "19684d04544903efe28c20cd82c1c1f8",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["acmwwFul_eRwbtcUiFOMV/_N_T_/layout-acmwwFul_eRwbtcUiFOMV/index"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "4ab74d2e1e3b591e3cbdcf4f9c71a503",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["acmwwFul_eRwbtcUiFOMV/_N_T_/layout-acmwwFul_eRwbtcUiFOMV/sitemap.xml"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "80dca86ae4b11ea881e99695795efee2",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["acmwwFul_eRwbtcUiFOMV/_N_T_/page"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "6d60d153112d361195ed55b4df9be72f",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["acmwwFul_eRwbtcUiFOMV/_N_T_/sitemap.xml"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "9e184d0200da7bb4716b006beba2afb8",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["acmwwFul_eRwbtcUiFOMV/_N_T_/sitemap.xml/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "72b44a81989cfdc26db9ea4a0e365a1a",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["acmwwFul_eRwbtcUiFOMV/_N_T_/sitemap.xml/route"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "92f93a9031ddb15ddd85a394011e1c92",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/"] will be destroyed
  # (because key ["d-3LMEC_2wlROao-vtI6Q/_N_T_/"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "cd675b83-3f0e-2809-586d-4a76f1c574a2" -> null
      - triggers_replace = [
          - "nextjs",
          - "2839da79181ee294e410b8af40194f03",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/_not-found"] will be destroyed
  # (because key ["d-3LMEC_2wlROao-vtI6Q/_N_T_/_not-found"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "d458912e-3c75-e100-aefe-363503d03741" -> null
      - triggers_replace = [
          - "nextjs",
          - "883e60756feaa48f50b45393f127215f",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/_not-found/layout"] will be destroyed
  # (because key ["d-3LMEC_2wlROao-vtI6Q/_N_T_/_not-found/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "222a84e0-2a59-9b97-b0d3-54fe02e7e9eb" -> null
      - triggers_replace = [
          - "nextjs",
          - "065216d7bf7f1d9f5fe1a1720e4ce0b7",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/_not-found/page"] will be destroyed
  # (because key ["d-3LMEC_2wlROao-vtI6Q/_N_T_/_not-found/page"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "693c511e-7d48-12da-2420-033e4ee137ff" -> null
      - triggers_replace = [
          - "nextjs",
          - "e4518e94a15d037096a76472e88b32e7",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/apple-icon.png"] will be destroyed
  # (because key ["d-3LMEC_2wlROao-vtI6Q/_N_T_/apple-icon.png"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "e95cd2a6-bf2c-60d7-bfd3-08e448b9ac9e" -> null
      - triggers_replace = [
          - "nextjs",
          - "273fb9378efed16f0e3a8f197c987e07",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/apple-icon.png/layout"] will be destroyed
  # (because key ["d-3LMEC_2wlROao-vtI6Q/_N_T_/apple-icon.png/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "6d1dd48b-fbfd-fa42-8764-7c429ace74a1" -> null
      - triggers_replace = [
          - "nextjs",
          - "602c4b31662f95b876d783acf37ac32c",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/apple-icon.png/route"] will be destroyed
  # (because key ["d-3LMEC_2wlROao-vtI6Q/_N_T_/apple-icon.png/route"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "e2bf2fe4-d2cd-4284-e4cc-edd6a199f3e5" -> null
      - triggers_replace = [
          - "nextjs",
          - "207cf02c01d0c6a5af95730d6450a615",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/cgv"] will be destroyed
  # (because key ["d-3LMEC_2wlROao-vtI6Q/_N_T_/cgv"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "ae2f1d79-3bb0-bda1-1c89-f7ea80326212" -> null
      - triggers_replace = [
          - "nextjs",
          - "ecdd10ea5d8f9f6e9e00e5fc14289375",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/cgv/layout"] will be destroyed
  # (because key ["d-3LMEC_2wlROao-vtI6Q/_N_T_/cgv/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "582d6999-e02e-d8ef-a6d6-388a30d0b5e6" -> null
      - triggers_replace = [
          - "nextjs",
          - "59b117443926d14e39e7a7e4ff330caf",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/cgv/page"] will be destroyed
  # (because key ["d-3LMEC_2wlROao-vtI6Q/_N_T_/cgv/page"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "53779383-ff47-3831-bdaa-3262f8eebe7d" -> null
      - triggers_replace = [
          - "nextjs",
          - "e5d4d53043ed697786205b0fd4e7e6e2",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/favicon.ico"] will be destroyed
  # (because key ["d-3LMEC_2wlROao-vtI6Q/_N_T_/favicon.ico"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "df57e89b-0052-4dc4-fa41-7b4d53df4757" -> null
      - triggers_replace = [
          - "nextjs",
          - "92acfed36c61e6a4d66ab886ff214190",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/favicon.ico/layout"] will be destroyed
  # (because key ["d-3LMEC_2wlROao-vtI6Q/_N_T_/favicon.ico/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "53e885f5-6d19-1265-05d4-4f5a6db5d4a2" -> null
      - triggers_replace = [
          - "nextjs",
          - "b599a9650995adb8bc01dd7dfa853814",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/favicon.ico/route"] will be destroyed
  # (because key ["d-3LMEC_2wlROao-vtI6Q/_N_T_/favicon.ico/route"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "555a3ba0-f92b-fb70-3df1-1ba12c9efb50" -> null
      - triggers_replace = [
          - "nextjs",
          - "4a3edc88b3f076546f7adc20bd5836a1",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/icon.svg"] will be destroyed
  # (because key ["d-3LMEC_2wlROao-vtI6Q/_N_T_/icon.svg"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "afe6a38e-d7d2-fc70-6f59-c0480b88519d" -> null
      - triggers_replace = [
          - "nextjs",
          - "8b87507aae7e3ef1f3a39d9a970fc009",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/icon.svg/layout"] will be destroyed
  # (because key ["d-3LMEC_2wlROao-vtI6Q/_N_T_/icon.svg/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "da4dd115-08db-a309-5a12-a1b86bc47b5e" -> null
      - triggers_replace = [
          - "nextjs",
          - "a364dbeb2df7316298787472cf33b7b6",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/icon.svg/route"] will be destroyed
  # (because key ["d-3LMEC_2wlROao-vtI6Q/_N_T_/icon.svg/route"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "b500aeb8-d7c5-7df6-31f4-1d6c47865f04" -> null
      - triggers_replace = [
          - "nextjs",
          - "15d3694a08844d03a095943ff2f38059",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/layout-d-3LMEC_2wlROao-vtI6Q/_not-found"] will be destroyed
  # (because key ["d-3LMEC_2wlROao-vtI6Q/_N_T_/layout-d-3LMEC_2wlROao-vtI6Q/_not-found"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "418f5693-b61c-3416-c159-ccc28713b5e6" -> null
      - triggers_replace = [
          - "nextjs",
          - "051d833eee76bcf0e282a48060da3b8f",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/layout-d-3LMEC_2wlROao-vtI6Q/apple-icon.png"] will be destroyed
  # (because key ["d-3LMEC_2wlROao-vtI6Q/_N_T_/layout-d-3LMEC_2wlROao-vtI6Q/apple-icon.png"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "b9b5eb65-a0ca-5602-812f-bfc50b04bfc1" -> null
      - triggers_replace = [
          - "nextjs",
          - "ceb8fcbd285d87112588a44c39914d93",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/layout-d-3LMEC_2wlROao-vtI6Q/cgv"] will be destroyed
  # (because key ["d-3LMEC_2wlROao-vtI6Q/_N_T_/layout-d-3LMEC_2wlROao-vtI6Q/cgv"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "b7bb7d9c-b66a-8023-3979-fe02f12a10b9" -> null
      - triggers_replace = [
          - "nextjs",
          - "670f0e75108c49bf51628aceb8b229e0",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/layout-d-3LMEC_2wlROao-vtI6Q/favicon.ico"] will be destroyed
  # (because key ["d-3LMEC_2wlROao-vtI6Q/_N_T_/layout-d-3LMEC_2wlROao-vtI6Q/favicon.ico"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "817cbbf1-9d53-4d82-785d-5d2ce85d7184" -> null
      - triggers_replace = [
          - "nextjs",
          - "8db6ad3f33cd4bfc6ee6ec7b1162b0e1",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/layout-d-3LMEC_2wlROao-vtI6Q/icon.svg"] will be destroyed
  # (because key ["d-3LMEC_2wlROao-vtI6Q/_N_T_/layout-d-3LMEC_2wlROao-vtI6Q/icon.svg"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "5f750aad-a23c-2b3d-0587-786870115a92" -> null
      - triggers_replace = [
          - "nextjs",
          - "7aa10679a2e4088363f28a3938f107db",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/layout-d-3LMEC_2wlROao-vtI6Q/index"] will be destroyed
  # (because key ["d-3LMEC_2wlROao-vtI6Q/_N_T_/layout-d-3LMEC_2wlROao-vtI6Q/index"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "26e00b62-2a52-92e3-b983-1816c9e8a086" -> null
      - triggers_replace = [
          - "nextjs",
          - "0be627b36e62caddab26030f5c469a70",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/layout-d-3LMEC_2wlROao-vtI6Q/sitemap.xml"] will be destroyed
  # (because key ["d-3LMEC_2wlROao-vtI6Q/_N_T_/layout-d-3LMEC_2wlROao-vtI6Q/sitemap.xml"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "5a8f826a-12d7-3aca-72d2-d905d309e11d" -> null
      - triggers_replace = [
          - "nextjs",
          - "8bcbcf28ee81cdcd404e56e71de04f99",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/page"] will be destroyed
  # (because key ["d-3LMEC_2wlROao-vtI6Q/_N_T_/page"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "1475dba4-d8b2-e049-29bd-dc57c5fb018e" -> null
      - triggers_replace = [
          - "nextjs",
          - "1a979f36ce2c1d1d5186d5175f37957d",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/sitemap.xml"] will be destroyed
  # (because key ["d-3LMEC_2wlROao-vtI6Q/_N_T_/sitemap.xml"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "25d1385f-57bb-0439-2c9e-99bd58f8d66f" -> null
      - triggers_replace = [
          - "nextjs",
          - "637b6d83d222552aad43b4ce233faf30",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/sitemap.xml/layout"] will be destroyed
  # (because key ["d-3LMEC_2wlROao-vtI6Q/_N_T_/sitemap.xml/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "4acb64e1-429f-bc19-4ae7-9a31429bdd75" -> null
      - triggers_replace = [
          - "nextjs",
          - "0e0bf115207edc405bfe994f0bc40b55",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["d-3LMEC_2wlROao-vtI6Q/_N_T_/sitemap.xml/route"] will be destroyed
  # (because key ["d-3LMEC_2wlROao-vtI6Q/_N_T_/sitemap.xml/route"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "85f0371d-cede-f559-23d6-fafd6f0271e3" -> null
      - triggers_replace = [
          - "nextjs",
          - "90145992da6bac3606d55d3afa5a6474",
        ] -> null
    }

  # module.single_zone.module.image_optimisation_function[0].aws_lambda_function.lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_function" {
        id                             = "vltech-website-image-optimization-function"
      ~ last_modified                  = "2025-02-24T15:36:47.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:20" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:20/invocations" -> (known after apply)
      ~ source_code_hash               = "ngfD/xUxHUdkNgjI6APL1wUrGUuv6IkZeQ1K1T7TN0Q=" -> "iBvXy2nCgNVMrgutMZ/5sxdMZHhJH3/lnMpWrI4QSgw="
        tags                           = {}
      ~ version                        = "20" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.single_zone.module.image_optimisation_function[0].terraform_data.update_alias[0] must be replaced
-/+ resource "terraform_data" "update_alias" {
      ~ id               = "bba5cb2b-44e8-23f5-5f61-ee635339623a" -> (known after apply)
      ~ triggers_replace = [
          ~ "20" -> (known after apply),
            "nextjs",
        ]
    }

  # module.single_zone.module.revalidation_function.aws_lambda_function.lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_function" {
        id                             = "vltech-website-revalidation-function"
      ~ last_modified                  = "2025-02-24T15:36:36.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-revalidation-function:20" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-revalidation-function:20/invocations" -> (known after apply)
      ~ source_code_hash               = "MDKqMimghXoAxLMe424KyGEfgCQk+ZYqF15X99MBPcQ=" -> "fCzcdMI7GMMElZKObKJZO2wLTCjzXPjHRo5KjAbozM0="
        tags                           = {}
      ~ version                        = "20" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.single_zone.module.revalidation_function.terraform_data.update_alias[0] must be replaced
-/+ resource "terraform_data" "update_alias" {
      ~ id               = "22986d2d-9503-b7f8-def7-84ab924dba32" -> (known after apply)
      ~ triggers_replace = [
          ~ "20" -> (known after apply),
            "stable",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["BUILD_ID"] must be replaced
-/+ resource "terraform_data" "file_sync" {
      ~ id               = "2aab1fc2-4689-8746-f3a1-8708229a17d9" -> (known after apply)
      ~ triggers_replace = [
            # (1 unchanged element hidden)
            "nextjs",
          ~ "9d0431781e009df594351bd0ce98544e" -> "2cc13a0e723a48c991df79d0d0bcffa0",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/acmwwFul_eRwbtcUiFOMV/_buildManifest.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "9a9bc883f7801dfd30597cebfafa30d0",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/acmwwFul_eRwbtcUiFOMV/_ssgManifest.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "b404e23d62d95bafd03ad7747cc0e88b",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/d-3LMEC_2wlROao-vtI6Q/_buildManifest.js"] will be destroyed
  # (because key ["_next/static/d-3LMEC_2wlROao-vtI6Q/_buildManifest.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "fd627028-348c-2400-caa7-8d41b1547ad6" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "9a9bc883f7801dfd30597cebfafa30d0",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/d-3LMEC_2wlROao-vtI6Q/_ssgManifest.js"] will be destroyed
  # (because key ["_next/static/d-3LMEC_2wlROao-vtI6Q/_ssgManifest.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "46814a4e-586f-4048-f404-98042c2a7f66" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "b404e23d62d95bafd03ad7747cc0e88b",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["acmwwFul_eRwbtcUiFOMV/500.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "01266bf6169a00ca55e11acb5209b84f",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["acmwwFul_eRwbtcUiFOMV/_not-found.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "1067e2b83c85c01e9156c807e52d2499",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["acmwwFul_eRwbtcUiFOMV/apple-icon.png.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "9843a61c98627e227286769373becd10",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["acmwwFul_eRwbtcUiFOMV/cgv.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "9403189b07c6f3894df5a48dc52f4cc9",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["acmwwFul_eRwbtcUiFOMV/favicon.ico.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "1253a11e7fded511c766a255028ab4ee",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["acmwwFul_eRwbtcUiFOMV/icon.svg.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "31e8b96a370a0c0409d732d5d9c1d2d6",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["acmwwFul_eRwbtcUiFOMV/index.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "fb9b261c60075fa540485063f2e46780",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["acmwwFul_eRwbtcUiFOMV/sitemap.xml.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "0592ec9ed0409fc8eeddd3ea25d4153e",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["d-3LMEC_2wlROao-vtI6Q/500.cache"] will be destroyed
  # (because key ["d-3LMEC_2wlROao-vtI6Q/500.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "f03a02f6-4368-6b0b-6cbc-9057739dbc7c" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "a774b1c1dc6ac19fc2903dedc753cf54",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["d-3LMEC_2wlROao-vtI6Q/_not-found.cache"] will be destroyed
  # (because key ["d-3LMEC_2wlROao-vtI6Q/_not-found.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "768e399e-6fad-62a6-9d69-fe46d061a9d8" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "b52a2c767e2e73a445ae7a63997de4a5",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["d-3LMEC_2wlROao-vtI6Q/apple-icon.png.cache"] will be destroyed
  # (because key ["d-3LMEC_2wlROao-vtI6Q/apple-icon.png.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "9eb88266-5130-b725-0144-1a8f43e5e2b9" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "9843a61c98627e227286769373becd10",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["d-3LMEC_2wlROao-vtI6Q/cgv.cache"] will be destroyed
  # (because key ["d-3LMEC_2wlROao-vtI6Q/cgv.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "dff691fa-92c1-d285-39cd-dcdd69b73293" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "c81e198043571aba0977e26926ba8b1f",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["d-3LMEC_2wlROao-vtI6Q/favicon.ico.cache"] will be destroyed
  # (because key ["d-3LMEC_2wlROao-vtI6Q/favicon.ico.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "e8a069fe-199a-d1db-efaa-57794a80a131" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "1253a11e7fded511c766a255028ab4ee",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["d-3LMEC_2wlROao-vtI6Q/icon.svg.cache"] will be destroyed
  # (because key ["d-3LMEC_2wlROao-vtI6Q/icon.svg.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "4037ad76-8edb-95b7-9aad-ac9b313fb1c2" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "31e8b96a370a0c0409d732d5d9c1d2d6",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["d-3LMEC_2wlROao-vtI6Q/index.cache"] will be destroyed
  # (because key ["d-3LMEC_2wlROao-vtI6Q/index.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "2d3ddee9-913c-e76b-9f87-76a5c4a469bd" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "cd6040eba00a8e87512fbca86cdd6fd1",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["d-3LMEC_2wlROao-vtI6Q/sitemap.xml.cache"] will be destroyed
  # (because key ["d-3LMEC_2wlROao-vtI6Q/sitemap.xml.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "5bd8ae58-3a52-57a2-9103-6b957576f4dd" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "9d8345c44d331771aad0cf3f859bf9b6",
        ] -> null
    }

  # module.single_zone.module.server_function.aws_lambda_function.lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_function" {
        id                             = "vltech-website-server-function"
      ~ last_modified                  = "2025-02-24T15:36:59.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:20" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:20/invocations" -> (known after apply)
      ~ source_code_hash               = "IUBvZQJ1JvxMiwtLUf5hkmBvt8Qcb0ewJOChdGwIZnU=" -> "Z+Hj3jxNepmcvfcOvqqjIjoFdah5OX/B7Dw3eiv05BY="
        tags                           = {}
      ~ version                        = "20" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.single_zone.module.server_function.terraform_data.update_alias[0] must be replaced
-/+ resource "terraform_data" "update_alias" {
      ~ id               = "469b777b-1e93-b36a-4fff-77386d1f2dff" -> (known after apply)
      ~ triggers_replace = [
          ~ "20" -> (known after apply),
            "nextjs",
        ]
    }

Plan: 41 to add, 3 to change, 41 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @dependabot[bot], Action: `pull_request`, Working Directory: `terraform`, Workflow: `PR Checks`*